## Data wrangling example

#### Data wrangling with pandas,python - On Employee Details dataset

Lets assume the data is collected through employee via different sources.

In [49]:
import pandas as pd

data = {
    "Name": ["Sharma, Sujan", "Shrestha, Diwas", "Acharya, Santosh ", "Dhungel, Shashank"],
    "Phone": ["98(65005564)", "+977 9876543210", "98-53426251", "9864536294"],
    "Address": ["Lalitpur, Balkumari", "Kathmandu, Baneshwor", "Chahabil, Kathmandu","Kathmandu, Maitidevi"],
    "Birth Date": ["April 1, 1999", "11/14/1998", "12 September 2000", "6-04-1999"],
    "Joined Date": ["6-04-2020","12 September 2020", "1/14/2023","August 1, 2023" ]
}

df = pd.DataFrame(data)

df

,Name,Phone,Address,Birth Date,Joined Date
0,"Sharma, Sujan",98(65005564),"Lalitpur, Balkumari","April 1, 1999",6-04-2020
1,"Shrestha, Diwas",+977 9876543210,"Kathmandu, Baneshwor",11/14/1998,12 September 2020
2,"Acharya, Santosh",98-53426251,"Chahabil, Kathmandu",12 September 2000,1/14/2023
3,"Dhungel, Shashank",9864536294,"Kathmandu, Maitidevi",6-04-1999,"August 1, 2023"

Formating the Name.

In [50]:
df['Name'] = df['Name'].str.split(', ').str[::-1].str.join(' ')

df

,Name,Phone,Address,Birth Date,Joined Date
0,Sujan Sharma,98(65005564),"Lalitpur, Balkumari","April 1, 1999",6-04-2020
1,Diwas Shrestha,+977 9876543210,"Kathmandu, Baneshwor",11/14/1998,12 September 2020
2,Santosh Acharya,98-53426251,"Chahabil, Kathmandu",12 September 2000,1/14/2023
3,Shashank Dhungel,9864536294,"Kathmandu, Maitidevi",6-04-1999,"August 1, 2023"

Formating the Phone to Actual 10 no.

In [51]:
df['Phone'] = df['Phone'].str.replace(r'^\+977\s*', '', regex=True)
df['Phone'] = df['Phone'].str.replace(r'\D', '', regex=True)
df

,Name,Phone,Address,Birth Date,Joined Date
0,Sujan Sharma,9865005564,"Lalitpur, Balkumari","April 1, 1999",6-04-2020
1,Diwas Shrestha,9876543210,"Kathmandu, Baneshwor",11/14/1998,12 September 2020
2,Santosh Acharya,9853426251,"Chahabil, Kathmandu",12 September 2000,1/14/2023
3,Shashank Dhungel,9864536294,"Kathmandu, Maitidevi",6-04-1999,"August 1, 2023"

Formating the Date to  actual date format

In [52]:
df['Birth Date'] = pd.to_datetime(df['Birth Date'])
df['Birth Date'] = df['Birth Date'].dt.strftime('%Y-%m-%d')
df['Joined Date'] = pd.to_datetime(df['Joined Date'])
df['Joined Date']  = df['Joined Date'].dt.strftime('%Y-%m-%d')
df

               Name       Phone               Address  Birth Date Joined Date
0      Sujan Sharma  9865005564   Lalitpur, Balkumari  1999-04-01  2020-06-04
1    Diwas Shrestha  9876543210  Kathmandu, Baneshwor  1998-11-14  2020-09-12
2  Santosh  Acharya  9853426251   Chahabil, Kathmandu  2000-09-12  2023-01-14
3  Shashank Dhungel  9864536294  Kathmandu, Maitidevi  1999-06-04  2023-08-01

Formating the Address to the `location, District` format

In [54]:
df['Address'] = df['Address'].apply(lambda x: ', '.join(reversed(x.split(', '))))
df

               Name       Phone               Address  Birth Date Joined Date
0      Sujan Sharma  9865005564   Lalitpur, Balkumari  1999-04-01  2020-06-04
1    Diwas Shrestha  9876543210  Kathmandu, Baneshwor  1998-11-14  2020-09-12
2  Santosh  Acharya  9853426251   Chahabil, Kathmandu  2000-09-12  2023-01-14
3  Shashank Dhungel  9864536294  Kathmandu, Maitidevi  1999-06-04  2023-08-01

## So as we have prepared the data into easy readable and right format.